W7D2/music_app/app/controllers/albums_controller.rb

  def show_bands_albums
    @albums = Album.where(band_id: params[:band_id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."band_id" = $1 ORDER BY "albums"."id" ASC LIMIT $2  [["band_id", 45], ["LIMIT", 1]]

  def create

    @album = Album.new(album_params)
    @album.band_id = params[:band_id]
    if @album.save
---
INSERT INTO "albums" ("band_id", "title", "year", "live", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["band_id", 72], ["title", "FUCK oeuoeu"], ["year", 1998], ["live", true], ["created_at", "2021-01-08 08:59:48.539715"], ["updated_at", "2021-01-08 08:59:48.539715"]]

  def update
    @album = find_album
    @album.update(album_params)
---
UPDATE "albums" SET "title" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["title", "Desperate Youtuidh, Blood Thirsty Babes"], ["updated_at", "2021-01-08 09:14:08.881584"], ["id", 69]]

  def destroy
    @album = find_album
    if @album
      @album.destroy
---
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 55]]

  def find_album
    Album.find_by(id: params[:id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 69], ["LIMIT", 1]]