W7D2/music_app/app/controllers/albums_controller.rb

  def find_album
    Album.find_by(id: params[:id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]