W7D2/music_app/app/controllers/bands_controller.rb

  def update
    @band = find_band
    albums = @band.albums
    @band.update(band_params)
    if @band.save
---
UPDATE "albums" SET "band_id" = 56 WHERE "albums"."band_id" = $1  [["band_id", 56]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Tv on the Radio"], ["updated_at", "2021-01-07 06:15:16.944191"], ["id", 44]]

  def destroy
    @band = find_band
    if @band
      @band.destroy
---
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 56]]

  def find_band
    Band.find_by(id: params[:id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 56], ["LIMIT", 1]]