W7D2/music_app/app/views/albums/edit.html.erb

    <option value="blank" selected disabled>
    <%Band.all.each do |band|%>
---
SELECT "bands".* FROM "bands"