W7D2/music_app/app/views/albums/new.html.erb

SELECT "bands".* FROM "bands"
---
    <option value="blank" selected disabled>
    <%Band.all.each do |band|%>