W7D2/music_app/app/views/albums/show_bands_albums.html.erb

<% else %>
<%    display = @albums.first.band.name %>
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 45], ["LIMIT", 1]]